In [18]:
people = {
    "Name": ["Arsalan", "Farhan", "Adnan"],
    "Hobby": ["Codeing", "Cycling", "Marketing"],
    "Email": ["arsalan1234@hotmail.com", "farhan124423@yahoo.com", "adnan23434@gmail.com"]
}

In [19]:
import pandas as pd

In [20]:
df = pd.DataFrame(people)

In [21]:
df

      Name      Hobby                    Email
0  Arsalan    Codeing  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [22]:
df["Email"]

0    arsalan1234@hotmail.com
1     farhan124423@yahoo.com
2       adnan23434@gmail.com
Name: Email, dtype: object

In [25]:
df.set_index("Email", inplace = True) #inplace = true sets the index

In [45]:
df

                            Name      Hobby
Email
arsalan1234@hotmail.com  Arsalan    Codeing
farhan124423@yahoo.com    Farhan    Cycling
adnan23434@gmail.com       Adnan  Marketing

In [46]:
df.index

Index(['arsalan1234@hotmail.com', 'farhan124423@yahoo.com',
       'adnan23434@gmail.com'],
      dtype='object', name='Email')

In [47]:
df.loc['arsalan1234@hotmail.com']

Name     Arsalan
Hobby    Codeing
Name: arsalan1234@hotmail.com, dtype: object

In [48]:
df.loc['arsalan1234@hotmail.com', "Name"]

'Arsalan'

In [49]:
df.iloc[0]

Name     Arsalan
Hobby    Codeing
Name: arsalan1234@hotmail.com, dtype: object

In [50]:
df.reset_index(inplace = True)

In [51]:
df

                     Email     Name      Hobby
0  arsalan1234@hotmail.com  Arsalan    Codeing
1   farhan124423@yahoo.com   Farhan    Cycling
2     adnan23434@gmail.com    Adnan  Marketing